package utils;

public class AsciiArt {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 메인
		System.out.println(" _______  _______ _______ _______     _______  _______ ___     ___         _______ _______ ___ ___ _______ ");
		System.out.println("|   _   \\|   _   |   _   |   _   |   |   _   \\|   _   |   |   |   |       |   _   |   _   |   Y   |   _   |");
		System.out.println("|.  1   /|.  1   |   1___|.  1___|   |.  1   /|.  1   |.  |   |.  |       |.  |___|.  1   |.      |.  1___|");
		System.out.println("|.  _   \\|.  _   |____   |.  __)_    |.  _   \\|.  _   |.  |___|.  |___    |.  |   |.  _   |. \\_/  |.  __)_ ");
		System.out.println("|:  1    |:  |   |:  1   |:  1   |   |:  1    |:  |   |:  1   |:  1   |   |:  1   |:  |   |:  |   |:  1   |");
		System.out.println("|::.. .  |::.|:. |::.. . |::.. . |   |::.. .  |::.|:. |::.. . |::.. . |   |::.. . |::.|:. |::.|:. |::.. . |");
		System.out.println(" `-------'`--- ---`-------`-------'   `-------'`--- ---`-------`-------'   `-------`--- ---`--- ---`-------'");
		                                            
		System.out.println();
		System.out.println();
		
		// 스트라이크
		System.out.println("   ___    _____    ___     ___    _  __    ___   ");
		System.out.println("  / __|  |_   _|  | _ \\   |_ _|  | |/ /   | __|  ");
		System.out.println("  \\__ \\    | |    |   /    | |   | ' <    | _|   ");
		System.out.println("  |___/   _|_|_   |_|_\\   |___|  |_|\\_\\   |___|  ");
		System.out.println("_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"| ");
		System.out.println("\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'");
		
		System.out.println();
		System.out.println();
		
		// 안타
		System.out.println("   ___     ___      ___    ___    _____  __   __");
		System.out.println("  / __|   /   \\    | __|  | __|  |_   _| \\ \\ / /");
		System.out.println("  \\__ \\   | - |    | _|   | _|     | |    \\ V /  ");
		System.out.println("  |___/   |_|_|   _|_|_   |___|   _|_|_   _|_|_  ");
		System.out.println("_|\"\"\"\"\"|_|\"\"\"\"\"|_| \"\"\" |_|\"\"\"\"\"|_|\"\"\"\"\"|_| \"\"\" | ");
		System.out.println("\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'");
		
		// 홈런
		System.out.println();
		System.out.println();
		
		System.out.println("  _  _     ___   __  __    ___     ___    _   _   _  _   ");
		System.out.println(" | || |   / _ \\ |  \\/  |  | __|   | _ \\  | | | | | \\| |  ");
		System.out.println(" | __ |  | (_) || |\\/| |  | _|    |   /  | |_| | | .` |  ");
		System.out.println(" |_||_|   \\___/ |_|__|_|  |___|   |_|_\\   \\___/  |_|\\_|  ");
		System.out.println("_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"|_|\"\"\"\"\"| ");
		System.out.println("\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'\"`-0-0-'");
	}
}
